application/gds/travelport/requests/AirCreateReservationReq (copy).xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
<AirCreateReservationReq xmlns="http://www.travelport.com/schema/universal_v36_0" TraceId="a677366a-b068-4145-9871-c91ba58a074e" AuthorizedBy="{AUTHORIZED_BY}" TargetBranch="{TARGET_BRANCH}" ProviderCode="1G" RetainReservation="None">
  <BillingPointOfSaleInfo xmlns="http://www.travelport.com/schema/common_v36_0" OriginApplication="UAPI" />
  <BookingTraveler xmlns="http://www.travelport.com/schema/common_v36_0" Key="OG9IN1k5YkVjek9mdmhLeg==" TravelerType="{TRAVELLER_TYPE}" 
  Age="{TRAVELLER_AGE}" DOB="{TRAVELLER_DOB}" Gender="{TRAVELLER_GENDER}" Nationality="{TRAVELLER_NATIONALITY}">
    <BookingTravelerName Prefix="{TRAVELLER_PREFIX}" First="{TRAVELLER_FIRSTNAME}" Last="{TRAVELLER_LASTNAME}" />
    <DeliveryInfo>
      <ShippingAddress Key="OG9IN1k5YkVjek9mdmhLeg==">
        <Street>{SHIPPING_STREET}</Street>
        <City>{SHIPPING_CITY}</City>
        <State>{SHIPPING_STATE}</State>
        <PostalCode>{SHIPPING_POSTALCODE}</PostalCode>
        <Country>{SHIPPING_COUNTRY}</Country>
      </ShippingAddress>
    </DeliveryInfo>
    <PhoneNumber Location="{PHONE_LOCATION}" CountryCode="{PHONE_COUNTRYCODE}" AreaCode="{PHONE_AREACODE}" Number="{PHONE_NUMBER}" />
    <Email EmailID="{TRAVELLER_EMAIL}" />
    <Address>
      <AddressName>{ADDRESS_NAME}</AddressName>
      <Street>{ADDRESS_STREET}</Street>
      <City>{ADDRESS_CITY}</City>
      <State>{SHIPPING_STATE}</State>
      <PostalCode>{ADDRESS_POSTALCODE}</PostalCode>
      <Country>{SHIPPING_COUNTRY}</Country>
    </Address>
  </BookingTraveler>
  <FormOfPayment xmlns="http://www.travelport.com/schema/common_v36_0" Type="Credit" Key="1">
    <CreditCard Type="{CREDITCARD_TYPE}" Number="{CREDITCARD_NUMBER}" ExpDate="{CREDITCARD_EXPDATE}" Name="{CREDITCARD_NAME}" CVV="{CREDITCARD_CVV}" Key="1">
      <BillingAddress Key="08a6140c-bd64-404e-8cf2-6d06ec327252">
        <AddressName>{ADDRESS_NAME}</AddressName>
        <Street>{ADDRESS_STREET}</Street>
        <City>{ADDRESS_CITY}</City>
        <State>{SHIPPING_STATE}</State>
        <PostalCode>{ADDRESS_POSTALCODE}</PostalCode>
        <Country>{SHIPPING_COUNTRY}</Country>
      </BillingAddress>
    </CreditCard>
  </FormOfPayment>
  <AirPricingSolution xmlns="http://www.travelport.com/schema/air_v36_0" Key="EMdSgRsvRDiQmFV63J1ZMA==" TotalPrice="{AIR_TOTALPRICE}" BasePrice="{AIR_BASEPRICE}" ApproximateTotalPrice="{AIR_APPRX_TOTALPRICE}" ApproximateBasePrice="{AIR_APPRX_BASEPRICE}" EquivalentBasePrice="{AIR_EQUIBASEPRICE}" Taxes="{AIR_TAXES}">
    {AIRSEGMENT}
    
    <AirPricingInfo PricingMethod="Auto" Taxes="{AIR_TAXES}" Key="zD3qPFAhSoi5iKSInH8QdA==" TotalPrice="{AIR_TOTALPRICE}" BasePrice="{AIR_BASEPRICE}" ApproximateTotalPrice="{AIR_APPRX_TOTALPRICE}" ApproximateBasePrice="{AIR_APPRX_BASEPRICE}" ProviderCode="1G">
      <FareInfo FareFamily="Economy Light" PromotionalFare="false" DepartureDate="{TO_DEPARTURE_DATE}" Amount="" EffectiveDate="{TO_EFFECTIVE_DATE}" Destination="{TO_DESTINATION}" Origin="{TO_ORIGIN}" PassengerTypeCode="ADT" FareBasis="K25LGT4" Key="REgC6gIoRMyUNCUaG1pJew==">
        <FareRuleKey FareInfoRef="REgC6gIoRMyUNCUaG1pJew==" ProviderCode="1G">6UUVoSldxwi5jaiD5Te3lsbKj3F8T9EyxsqPcXxP0TIjSPOlaHfQe5cuasWd6i8Dly5qxZ3qLwOXLmrFneovA5cuasWd6i8Dly5qxZ3qLwOXLmrFneovAyVlafI46WYPM3ExqSoG050OBzCme1vR3ZhJcjY/eERLVCulqMwbpNasTsU9/OBUcpP3vhsDFu0XbD2mIKCdpLK+c4NL8FZWf8siOHFaFMf8hf6E18cRejGVqfCTByZWB87h4wpuYhqXjyanCyGRxDLqNbjwzJx7oo0sKBvhNXxaOtQTd3Lo7sYawZ/ohFqk6/wBShF29N4Sv4Xvb2u1Qx+/he9va7VDH7+F729rtUMfv4Xvb2u1Qx8Qxibp/OJehpo2LrM59tO1jp8ZENljzx72lVAJ3nO/Pw0ClOCI+tT81IKv8rdRZDY8AdvxvULW9H1ZAoR40Ssx</FareRuleKey>
      </FareInfo>
     
      <BookingInfo BookingCode="K" CabinClass="Economy" FareInfoRef="REgC6gIoRMyUNCUaG1pJew==" SegmentRef="6k60n5UTQ/uNr17TY5vFKA==" />
      
      <TaxInfo Key="Ddzv4T+OQw+5j3A7Tv/u7Q==" Category="DE" Amount="EUR6.87" />
      <TaxInfo Key="cYReWAaST0+prw6S68avRQ==" Category="OY" Amount="EUR7.38" />
      <TaxInfo Key="mirWKYAAR9WAFYIhUQBGRw==" Category="RA" Amount="EUR13.71" />
      <TaxInfo Key="Jn0Eba+rRni/0fqqfrjXqg==" Category="CH" Amount="EUR29.58" />
      <TaxInfo Key="tma9UMzKRtOwR9HizPoo1Q==" Category="PT" Amount="EUR4.03" />
      <TaxInfo Key="MWUBAlgZSpiB3/BWndrF2Q==" Category="YP" Amount="EUR10.39" />
      <TaxInfo Key="K89a08PZR/qOYeKeigXNfA==" Category="YQ" Amount="EUR20.00" />
      <TaxInfo Key="Ffpsl+O+S4u5vlz+mesrtw==" Category="YR" Amount="EUR16.00" />
      <PassengerType Code="ADT" Age="40" BookingTravelerRef="OG9IN1k5YkVjek9mdmhLeg==" />
    </AirPricingInfo>
  </AirPricingSolution>
  <ActionStatus xmlns="http://www.travelport.com/schema/common_v36_0" Type="ACTIVE" TicketDate="T*" ProviderCode="1G" />
  <Payment xmlns="http://www.travelport.com/schema/common_v36_0" Key="2" Type="Itinerary" FormOfPaymentRef="1" Amount="{AIR_TOTALPRICE}" />
</AirCreateReservationReq>
 </soapenv:Body>
</soapenv:Envelope>
